# 1.打印1-100
# i = 1
# while i <= 100:
#     print("%s "%(i))
#     i += 1
# 2.打印1-1-100的偶数
# i = 1
# while i <= 100:
#     if i % 2 == 0:
#         print("%s "%(i))
#     i += 1
# 3.求1-100的和
# i = 1
# sum=0
# while i <= 100:
#     sum = sum + i
#     i += 1
# print("%s "%(sum))
# 4.求1-100的偶数和
# i = 1
# sum=0
# while i <= 100:
#     if i % 2 == 0:
#         sum = sum + i
#     i += 1
# print("%s "%(sum))
# 5.
# *
# **
# ***
# ****
# *****
# i = 1
# while i <=5:
#     print("*" * i)
#     i += 1
# 6.
# *
# ***
# *****
# *******
# *********
# i = 1
# t = 1
# while i <=5:
#     print("*" * t)
#     t += 2
#     i += 1

# 7.
# *
# ***
# *****
# *******
# *********
# *******
# *****
# ***
# *
# i = 1
# t = 1
# while i <=9:
#     if i <= 5:
#         print("*" * t)
#         if i == 5:
#             t -= 2
#         t += 2
#     else:
#         t -= 2
#         print("*" * t)
#     i += 1



