a = [213,214,23,4,35,43,5646,5,765,87,68,78,79,78,9,78,89,0,890,8,98,8,89,89,56,56,756,765,765]
# 1.3种方式遍历 (while,for,for)
# 1.
# i = 0
# while i < len(a):
#     print(a[i],end=" ")
#     i += 1
# 2.
# for i in range(0,len(a)):
#     print(a[i],end=" ")
# 3.
# for i in a:
#     print(i,end=" ")
# 2.求出该列表里面每个数字加起来的和
# s = 0
# for i in a:
#     s += i
# print(s)
#
# b = ['张三','李四','李佳琪','刘桂涛','刘嘉璐','郭燕']
# # 随机从列表中输出一个人的名字 (随机抽奖)
# import random
# a = random.randint(0,len(b)-1)
# print(b[a])
# print(random.choices(b))
# print(random.choice(b))

# a = [12,123,122,4,4]
# print(a)
#增
#1.在列表末尾插入
# a.append(45)
# [12, 123, 122, 4, 4]
# [12, 123, 122, 4, 4, 45]
#2.在列表末尾插入多个数据
# a.extend([10,20,30])
# [12, 123, 122, 4, 4]
# [12, 123, 122, 4, 4, 10, 20, 30]
#3.在列表指定的下标位置插入,如下:3下标
# a.insert(3,400)
# [12, 123, 122, 4, 4]
# [12, 123, 122, 400, 4, 4]

#删
#1.删除指定数据
# a.remove(12)
# [12, 123, 122, 4, 4]
# [123, 122, 4, 4]
# 2.删除指定下标数据
# a.pop(1)
# [12, 123, 122, 4, 4]
# [12, 122, 4, 4]
# 3.清空列表
# a.clear()
# [12, 123, 122, 4, 4]
# []

#改
# a[2]=444
# [12, 123, 122, 4, 4]
# [12, 123, 444, 4, 4]

#查
# 1.查找数据所在的下标
# b = a.index(12)
# [12, 123, 122, 4, 4]
# 0
# 2.查找数据在列表出现的次数
# b = a.count(4)
# [12, 123, 122, 4, 4]
# 2
# print(b)





